/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   cub3D.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mchau <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/11 13:59:25 by mchau             #+#    #+#             */
/*   Updated: 2021/03/12 11:30:51 by mchau            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "cub3D.h"

int main(int argc, char **argv)
{
	if (argc < 2)
	{
		//past map, urod
	}
	else
	{
		//чекаем расширение с конца == .cub и шобы далее с конца не было точки
		//как в .tar.gz -> ошибка с неправильным расширением
		//пытаемся открыть мапу, если ок
		//то пускаем парсер во все тяжкие, он может завершить приложение

		//теперь смотрим, есть ли 3 аргумент, т.к у argv отсутствует
		//nullterminate, то ток так argc == 3

		//если да, то
		//if ft_strcmp(argv[2], "--save") == 0?
		//{
		//  скрин делаем именно с original values, не макс скрином
		//	без какого-либо открытия окна
		//	make screenshot and save as bmp
		//}
		//иначе
		//пытаемся запустить игру
	}
	return (0);
}
