/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   map_parser.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mchau <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/12 10:36:44 by mchau             #+#    #+#             */
/*   Updated: 2021/03/12 10:47:17 by mchau            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int	map_parser(int fd, struct for allinfo, array for map)
{
	char *line;

	while (get_next_line(fd, &line))
	{
		//прежде заполняю структуру с инфо
		//она инициализирована отсутств значениями
		//заполняю каждое встретившееся
		//если оно уже заполнено -> ошибка
		//если пустая строка - идем дальше
		//при встрече в строке с информ тегом запускаем соответствующий парсер в строке
		//в конце начинаем заполнять карту
	}
	return (1);
}

