/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mchau <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/16 13:52:52 by mchau             #+#    #+#             */
/*   Updated: 2021/04/16 16:41:51 by mchau            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdlib.h>
#include <unistd.h>
#include <stdio.h>


int main(void)
{
	int pid;
	int fd[2];

	pipe(fd); //защити [ отсюда считываем, cюда записываем ]
	pid = fork(); // защити
	write(fd[1], "1", 1);
	if (!pid)
	{
		close(fd[1]);
		dup2(fd[0], 0);
		execl("./test", 0); //защити
	}
	close(fd[0]);
	dup2(fd[1], 1);
	//while (1)
		write(fd[1], "1", 1); //раньше пишем в буфер, чем запускается дочерний процесс, но разве это не кусок памяти?
	return (0);
}
